## Guardando imformações num banco de dados

In [1]:
import sqlite3
import pandas as pd

In [5]:
conn = sqlite3.connect('web.db')
df_data = pd.read_csv('bd_data.csv', index_col=0)
df_data

              Time_Stamp    A    B    C   D  SITUACAO         Z
b    2022-01-04 23:43:44  217  227  244  58         2       NaN
1    2022-01-05 00:43:50  213  223  239  58         2  1.001667
2    2022-01-05 01:43:54  209  218  233  58         2  1.001111
3    2022-01-05 02:44:01  204  214  228  58         2  1.001944
4    2022-01-05 03:44:07  200  209  222  58         2  1.001667
..                   ...  ...  ...  ...  ..       ...       ...
196  2022-01-26 03:32:29  221  231  243  60         2  1.001389
197  2022-01-26 04:32:38  216  226  237  60         2  1.002500
198  2022-01-26 05:32:46  211  221  231  60         2  1.002222
199  2022-01-26 07:16:09  203  212  222  60         2  1.723056
200  2022-01-26 08:16:16  198  208  217  60         2  1.001944

[201 rows x 7 columns]

In [7]:
df_data.index.name = 'index_name'
df_data

                     Time_Stamp    A    B    C   D  SITUACAO         Z
index_name
b           2022-01-04 23:43:44  217  227  244  58         2       NaN
1           2022-01-05 00:43:50  213  223  239  58         2  1.001667
2           2022-01-05 01:43:54  209  218  233  58         2  1.001111
3           2022-01-05 02:44:01  204  214  228  58         2  1.001944
4           2022-01-05 03:44:07  200  209  222  58         2  1.001667
...                         ...  ...  ...  ...  ..       ...       ...
196         2022-01-26 03:32:29  221  231  243  60         2  1.001389
197         2022-01-26 04:32:38  216  226  237  60         2  1.002500
198         2022-01-26 05:32:46  211  221  231  60         2  1.002222
199         2022-01-26 07:16:09  203  212  222  60         2  1.723056
200         2022-01-26 08:16:16  198  208  217  60         2  1.001944

[201 rows x 7 columns]

In [8]:
df_data.to_sql('data', conn, index_label= 'index_name') #(nome, engine de conexao)

201

In [9]:
c =conn.cursor() #ponteiro

In [11]:
c.execute('CREATE TABLE products (product_id, product_name, price)') # comandos em sql sao todos em maiusculo

In [13]:
c.execute('DROP TABLE products') #deleta
c.execute('DROP TABLE data')

OperationalError: no such table: products

In [15]:
c.execute('CREATE TABLE products ([product_id] INTERGER PRIMARY KEY, [product_name] TEXT, [price] INTERGER)')

## insert

In [19]:
c.execute('''INSERT INTO products (product_id, product_name, price)
    VALUES
    (1, 'computer', 800),
    (2, 'printer', 800),
    (3, 'tablet', 800)

          ''') # comandos em sql sao todos em maiusculo

In [20]:
conn.commit()